"""
長さがそれぞれL[i]であるようなN本のひもがある.
これらのひもを切って, 同じ長さのひもをK本作るときの最長の長さを求めなさい.
答えは小数点以下2桁までを切り捨てで出力しないさい.


制約
1<=n<=10^4
1<=k<=10^4
1<=L[i]<=10^5
"""
#-------------------------------------------------------------------------------

#c(x) = 長さxのひもをK本切り出すことができる = sum(floor(l[i]/x))>=k
def c(x):
    ans=0
    for i in l:
        ans+=int(i/x)
    return ans>=k
n,k=map(int,input().split())
l=list(map(float,input().split()))
L,R=0,101010 # K本以上になる最長の長さを二分探索する.
for i in range(100):
    mid=(L+R)/2
    if c(mid):
        L=mid
    else:
        R=mid
print('{:.2f}'.format(L))


"""
入力例

4 11
8.02 7.45 4.57 5.39
"""